# Excel and Csv

In [19]:
import pandas as pd 
import numpy as np
import matplotlib.pyplot as plt

In [20]:
df = pd.read_excel("D:\\ML\\10. ML - Land details.xlsx")
df

   land   area       price
0      1    11       13333
1      2    22       235w3
2      3    33     5663553
3      4    44    35356646
4      5    55  3435356664

In [21]:
df.head(3)

   land   area    price
0      1    11    13333
1      2    22    235w3
2      3    33  5663553

##  Info

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   land    5 non-null      int64
 1   area    5 non-null      int64
 2   price   5 non-null      object
dtypes: int64(2), object(1)
memory usage: 252.0+ bytes

##  Describe

In [23]:
df.describe()   # It chhose only Int64

          land        area
count  5.000000   5.000000
mean   3.000000  33.000000
std    1.581139  17.392527
min    1.000000  11.000000
25%    2.000000  22.000000
50%    3.000000  33.000000
75%    4.000000  44.000000
max    5.000000  55.000000

##  data Selection

In [25]:
df.iloc[: , [0,2]]

   land        price
0      1       13333
1      2       235w3
2      3     5663553
3      4    35356646
4      5  3435356664